backend/app/Models/BannersModel.php

    public function active(): array
    {
        $now = date('Y-m-d H:i:s');

        $this->where('is_active', 1)
             ->groupStart()
                ->where('is_permanent', 1)
                ->orGroupStart()
                    ->where('from_date <=', $now)
                    ->where('to_date >=', $now)
                ->groupEnd()
             ->groupEnd()
             ->orderBy('sort_order', 'ASC');

        return $this->findAll();
---
SELECT *
FROM `banners`
WHERE `is_active` = 1
AND   (
`is_permanent` = 1
OR    (
`from_date` <= '2026-03-03 13:49:34'
AND `to_date` >= '2026-03-03 13:49:34'
  )
 )
ORDER BY `sort_order` ASC

    public function paginated(int $page = 1, int $perPage = 20): array
    {
        $total = $this->countAllResults(false);
        $data  = $this->orderBy('sort_order', 'ASC')->findAll($perPage, ($page - 1) * $perPage);
---
SELECT COUNT(*) AS `numrows`
FROM `banners`
SELECT *
FROM `banners`
ORDER BY `sort_order` ASC
 LIMIT 20