backend/app/Models/CategoriesModel.php

    public function getTree(): array
    {
        $all = $this->orderBy('sort_order', 'ASC')->orderBy('id', 'ASC')->findAll();
---
SELECT *
FROM `categories`
ORDER BY `sort_order` ASC, `id` ASC