backend/app/Models/ProductsModel.php

SELECT *
FROM `products`
WHERE `slug` = 'wardrobe'
AND `products`.`deleted_at` IS NULL
 LIMIT 1
---
    public function findBySlug(string $slug): ?array
    {
        return $this->where('slug', $slug)->first();

SELECT COUNT(*) AS `numrows`
FROM `products`
LEFT JOIN `categories` ON `categories`.`id` = `products`.`category_id`
WHERE `products`.`category_id` = 2
AND `products`.`deleted_at` IS NULL
SELECT `products`.*, `categories`.`name` as `category_name`
FROM `products`
LEFT JOIN `categories` ON `categories`.`id` = `products`.`category_id`
WHERE `products`.`category_id` = 2
AND `products`.`deleted_at` IS NULL
ORDER BY `products`.`created_at` DESC
 LIMIT 12
---
    public function paginated(int $page = 1, int $perPage = 12, ?string $q = null, ?int $categoryId = null): array
    {
        $this->select('products.*, categories.name as category_name')
             ->join('categories', 'categories.id = products.category_id', 'left');

        if ($categoryId) {
            $this->where('products.category_id', $categoryId);
        }

        $this->applyLike(['products.name', 'products.sku'], $q);

        $total = $this->countAllResults(false);
        $data  = $this->orderBy('products.created_at', 'DESC')
                      ->findAll($perPage, ($page - 1) * $perPage);

SELECT *
FROM `product_images`
WHERE `product_id` = '1'
ORDER BY `sort_order` ASC
SELECT *
FROM `product_specs`
WHERE `product_id` = '1'
ORDER BY `sort_order` ASC
SELECT *
FROM `categories`
WHERE `id` = '2'
---
    public function withImagesAndSpecs(array $product): array
    {
        $db = \Config\Database::connect();

        $images = $db->table('product_images')
            ->where('product_id', $product['id'])
            ->orderBy('sort_order', 'ASC')
            ->get()->getResultArray();

        $specs = $db->table('product_specs')
            ->where('product_id', $product['id'])
            ->orderBy('sort_order', 'ASC')
            ->get()->getResultArray();

        $category = null;
        if ($product['category_id']) {
            $category = $db->table('categories')
                ->where('id', $product['category_id'])
                ->get()->getRowArray();