backend/app/Models/ProjectsModel.php

    public function paginated(int $page = 1, int $perPage = 12, ?string $q = null, bool $activeOnly = false): array
    {
        if ($activeOnly) {
            $this->where('is_active', 1);
        }
        $this->applyLike(['title', 'location', 'description'], $q);
        $total = $this->countAllResults(false);
        $data  = $this->orderBy('sort_order', 'ASC')->orderBy('id', 'DESC')
                      ->findAll($perPage, ($page - 1) * $perPage);
---
SELECT COUNT(*) AS `numrows`
FROM `projects`
SELECT *
FROM `projects`
ORDER BY `sort_order` ASC, `id` DESC
 LIMIT 12