backend/app/Models/UsersModel.php

    public function findByEmail(string $email): ?array
    {
        return $this->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'editor@test.com'
 LIMIT 1

    public function createAdmin(array $data): int|false
    {
        $now = date('Y-m-d H:i:s');
        return $this->insert([
            'name'          => $data['name'],
            'email'         => $data['email'],
            'password_hash' => password_hash($data['password'], PASSWORD_BCRYPT),
            'role'          => $data['role'] ?? 'editor',
            'created_at'    => $now,
            'updated_at'    => $now,
        ]);
---
INSERT INTO `users` (`name`, `email`, `password_hash`, `role`, `created_at`, `updated_at`) VALUES ('Editor User', 'editor@test.com', '$2y$12$xBkqenrc0Yzd7xAYQzkv7eGfFQe6E4Z6.clEX7EWQDOGaxxYlgKjO', 'editor', '2026-03-03 13:23:21', '2026-03-03 13:23:21')

    public function paginated(int $page = 1, int $perPage = 20, ?string $q = null): array
    {
        $this->applyLike(['name', 'email'], $q);
        $total = $this->countAllResults(false);
        $data  = $this->orderBy('id', 'ASC')
                      ->findAll($perPage, ($page - 1) * $perPage);
---
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT *
FROM `users`
ORDER BY `id` ASC
 LIMIT 20