backend/app/Controllers/Public/Products.php

        $db = \Config\Database::connect();
        $enriched = [];
        foreach ($result['data'] as $p) {
            $img = $db->table('product_images')
                ->where('product_id', $p['id'])
                ->orderBy('sort_order', 'ASC')
                ->limit(1)->get()->getRowArray();
---
SELECT *
FROM `product_images`
WHERE `product_id` = '1'
ORDER BY `sort_order` ASC
 LIMIT 1