backend/app/Controllers/Api/Products.php

    public function index(): ResponseInterface
    {
        $page    = max(1, (int) ($this->request->getGet('page') ?? 1));
        $perPage = min(48, max(1, (int) ($this->request->getGet('per_page') ?? 12)));
        $q       = $this->request->getGet('q') ?: null;
        $catId   = $this->request->getGet('category_id') ? (int)$this->request->getGet('category_id') : null;

        $result = $this->model->paginated($page, $perPage, $q, $catId);

        // Attach first image + image count
        $db = \Config\Database::connect();
        foreach ($result['data'] as &$p) {
            $img = $db->table('product_images')
                ->where('product_id', $p['id'])
                ->orderBy('sort_order', 'ASC')->limit(1)->get()->getRowArray();
---
SELECT *
FROM `product_images`
WHERE `product_id` = '1'
ORDER BY `sort_order` ASC
 LIMIT 1

    public function create(): ResponseInterface
    {
        helper('slugify');
        $data = $this->request->getJSON(true) ?? [];

        $name = trim($data['name'] ?? '');
        if (!$name) return $this->response->setStatusCode(422)->setJSON(['error' => 'Product name is required.']);

        $now  = date('Y-m-d H:i:s');
        $slug = generate_unique_slug($name, 'products');

        $id = $this->model->insert([
            'name'        => $name,
            'slug'        => $slug,
            'sku'         => $data['sku'] ?? null,
            'description' => $data['description'] ?? null,
            'category_id' => $data['category_id'] ?? null,
            'is_active'   => $data['is_active'] ?? 1,
            'meta'        => isset($data['meta']) ? json_encode($data['meta']) : null,
            'created_at'  => $now,
            'updated_at'  => $now,
        ]);
---
INSERT INTO `products` (`name`, `slug`, `sku`, `description`, `category_id`, `is_active`, `meta`, `created_at`, `updated_at`) VALUES ('Test Door', 'test-door', 'TD-001', 'A test door', 2, 1, NULL, '2026-03-03 13:23:21', '2026-03-03 13:23:21')